tests/cavity_sin_test/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("libuserfiniteVolume.so")

application     cwipiIcoFoamPar;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.0001;

writeControl    runTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

cwipiSwitch     true;

functions
{
    monitoringProbe
    {
	    type            probes;
	    libs            ("libsampling.so");
	    enabled         true;
	    writeControl    timeStep;
	    writeInterval   2;
	    interpolationScheme cellPointFace;
	    fields
	    (
		U
	    );

	    probeLocations
	    (
		(0.05 0.1 0.005)
	    );
    }
}

// ************************************************************************* //
